Revit 2024 API
BuiltInFailures.CurtainWallFailures.DeletingCurtainSystemFaceGridLines Property
 Deleting Grid Lines residing on faces that no longer are part of a Curtain System.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DeletingCurtainSystemFaceGridLines { get; }
Visual Basic
Public Shared ReadOnly Property DeletingCurtainSystemFaceGridLines As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DeletingCurtainSystemFaceGridLines {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace